## Analisis de datos con Pandas

In [3]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

### Series

In [4]:
sr1 = pd.Series([1,2,3,4,5])
sr1.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

Las series posen index (se pueden modificar con una lista, pueden ser letras), basicamente se comportan como una columna con celdas

In [7]:
print(sr1[:1])

0    1
dtype: int64

### Dataframe

In [13]:
#dict_data = {'CH':[100, 800, 200],'CO':[100, 200, 300],'MX':[300, 500, 400]}
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df.head()

        edad   cm pais genero    Q1  Q2
ana       10  115   co      M   5.0   7
benito     9  110   mx      F  10.0   9
camilo    13  130   co      F   8.0   9
daniel    14  155   mx      M   NaN   8
erika     12  125   mx      M   7.0   8

In [16]:
print(df.index)
print(df.columns)
print(df.values)

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')
Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')
[[10 115 'co' 'M' 5.0 7]
 [9 110 'mx' 'F' 10.0 9]
 [13 130 'co' 'F' 8.0 9]
 [14 155 'mx' 'M' nan 8]
 [12 125 'mx' 'M' 7.0 8]
 [11 120 'ch' 'M' 8.0 8]
 [12 125 'ch' 'F' 3.0 9]]

In [17]:
df['edad']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

In [18]:
df[['edad','pais']]

          edad pais
ana         10   co
benito       9   mx
camilo      13   co
daniel      14   mx
erika       12   mx
fabian      11   ch
gabriela    12   ch

In [24]:
df.loc['ana',['edad','pais']]

edad    10
pais    co
Name: ana, dtype: object

In [22]:
df.iloc[0]['edad']

10

### Filtros

In [25]:
df[df['edad']>12]

        edad   cm pais genero   Q1  Q2
camilo    13  130   co      F  8.0   9
daniel    14  155   mx      M  NaN   8

In [27]:
df.query('edad>12')

        edad   cm pais genero   Q1  Q2
camilo    13  130   co      F  8.0   9
daniel    14  155   mx      M  NaN   8